$commit = Invoke-RestMethod -Uri "https://api.github.com/repos/ki8y/konos/commits/main"
Write-Host @"
   [38;5;99m╭──────────────────╮                                                                                 ╭───────────╮
   │  ⚙️ [97mv0.50 ALPHA[38;5;99m  │                                                                                 │  [97m$($commit.sha.Substring(0,7))[38;5;99m  │
   ╰──────────────────╯                                                                                 ╰───────────╯
"@                     
#
<# 
Version: 0.50 ALPHA

   ╭──────────────────╮                                                                                 ╭───────────╮
   │  ⚙️ v0.50 ALPHA  │                                                                                 │  fffffff  │
   ╰──────────────────╯                                                                                 ╰───────────╯

#>